# UnableToCreateMultistoryStairs Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..UnableToCreateMultistoryStairs Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Unable to create Multistory stairs.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId UnableToCreateMultistoryStairs { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property UnableToCreateMultistoryStairs As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ UnableToCreateMultistoryStairs {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace